/*******************************************************************************
 *
 * Copyright (C) 2012 Jorge Aparicio <jorge.aparicio.r@gmail.com>
 *
 * This file is part of libstm32pp.
 *
 * libstm32pp is free software: you can redistribute it and/or modify it under
 * the terms of the GNU Lesser General Public License as published by the Free
 * Software Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * libstm32pp is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with libstm32pp. If not, see <http://www.gnu.org/licenses/>.
 *
 ******************************************************************************/

#pragma once

#include "common.hpp"

namespace rcc {
#ifdef STM32F1XX
  struct Registers
  {
      __RW
      u32 CR;        // 0x00: Clock control
      __RW
      u32 CFGR;      // 0x04: Clock configuration
      __RW
      u32 CIR;       // 0x08: Clock interrupt
      __RW
      u32 APB2RSTR;  // 0x0C: APB2 peripheral reset
      __RW
      u32 APB1RSTR;  // 0x10: APB1 peripheral reset
      __RW
      u32 AHBENR;    // 0x14: AHB peripheral clock enable
      __RW
      u32 APB2ENR;   // 0x18: APB2 peripheral clock enable
      __RW
      u32 APB1ENR;   // 0x1C: APB1 peripheral clock enable
      __RW
      u32 BDCR;      // 0x20: Backup domain control
      __RW
      u32 CSR;       // 0x24: Control/status
      __RW
      u32 AHBRSTR;   // 0x28: AHB peripheral clock reset
      __RW
      u32 CFGR2;     // 0x2C: Clock configuration 2
  };
#else // STM32F1XX
  struct Registers
  {
    __RW
    u32 CR;            // 0x00: Clock control
    __RW
    u32 PLLCFGR;// 0x04: PLL configuration
    __RW
    u32 CFGR;// 0x08: Clock configuration
    __RW
    u32 CIR; // 0x0C: Clock interrupt
    __RW
    u32 AHB1RSTR;// 0x10: AHB1 peripheral reset
    __RW
    u32 AHB2RSTR;// 0x14: AHB2 peripheral reset
    __RW
    u32 AHB3RSTR;// 0x18: AHB3 peripheral reset
    u32 _RESERVED0;// _RESERVED
    __RW
    u32 APB1RSTR;// 0x20: APB1 peripheral reset
    __RW
    u32 APB2RSTR;// 0x24: APB2 peripheral reset
    u32 _RESERVED1[2];
    __RW
    u32 AHB1ENR;// 0x30: AHB1 peripheral clock enable
    __RW
    u32 AHB2ENR;// 0x34: AHB2 peripheral clock enable
    __RW
    u32 AHB3ENR;// 0x38: AHB3 peripheral clock enable
    u32 _RESERVED2;// _RESERVED
    __RW
    u32 APB1ENR;// 0x40: APB1 peripheral clock enable
    __RW
    u32 APB2ENR;// 0x44: APB2 peripheral clock enable
    u32 _RESERVED3[2];
    __RW
    u32 AHB1LPENR;// 0x50: AHB1 peripheral clock enable in low power
    __RW
    u32 AHB2LPENR;// 0x54: AHB2 peripheral clock enable in low power
    __RW
    u32 AHB3LPENR;// 0x58: AHB3 peripheral clock enable in low power
    u32 _RESERVED4;
    __RW
    u32 APB1LPENR;// 0x60: APB1 peripheral clock enable in low power
    __RW
    u32 APB2LPENR;// 0x64: APB2 peripheral clock enable in low power
    u32 _RESERVED5[2];// _RESERVED
    __RW
    u32 BDCR;// 0x70: Backup domain control
    __RW
    u32 CSR; // 0x74: Clock control and status
    u32 _RESERVED6[2];
    __RW
    u32 SSCGR;// 0x80: Spread spectrum clock generation
    __RW
    u32 PLLI2SCFGR;// 0x84: PLLI2S configuration
  };
#endif // STM32F1XX
#ifdef STM32F1XX
  enum {
    ADDRESS = alias::address::AHB + 0x1000
  };
#else
  enum {
    ADDRESS = alias::address::AHB1 + 0x3800
  };
#endif

#ifdef STM32F1XX
  namespace registers {
    namespace cr {
      enum {
        OFFSET = 0x00
      };
      namespace bits {
        namespace hsion {
          enum {
            POSITION = 0
          };
          enum {
            MASK = 1 << POSITION
          };
          namespace states {
            enum E {
              HSI_OSCILLATOR_OFF = 0 << POSITION,
              HSI_OSCILLATOR_ON = 1 << POSITION,
            };
          }  // namespace states
        }  // namespace hsion
        namespace hsirdy {
          enum {
            POSITION = 1
          };
          enum {
            MASK = 1 << POSITION
          };
          namespace states {
            enum E {
              HSI_OSCILLATOR_NOT_READY = 0 << POSITION,
